const repeatWord = require('./repeatWord');


test('тест для проверки вывода слова "так" 4 раза', () => {
    expect(repeatWord('так', 4)).toBe('так1, так2, так3, так4');
});

test('тест для проверки вывода слова "пукус" 4 раза', () => {
    expect(repeatWord('пукус', 3)).toBe('пукус1, пукус2, пукус3');
});

test('тест для проверки вывода null 4 раза', () => {
    expect(() =>{repeatWord(null, 4)}).toThrow("Невалидные данные");
});

test('тест для проверки вывода цифры 4 раза', () => {
    expect(() =>{repeatWord(3, 4)}).toThrow("Невалидные данные");
});